Config.org
#+title: my Emacs configuration
#+property: header-args :tangle src/main.el :comments link

TODO: I will try to make my configuration fully literate, since the pros seem to outweigh the cons.
- [X] i can start off with big chunks, whole files big, then divide them up.

- [X] i wonder if i can just have one big init file... for now, that'll be main-future.el

- [ ] automatically insert a banner comment or something before tangling each code block

- [ ] org mode is currently slow bc of minor modes like the image-slicing and org latex stuff

- [ ] put everything inside of a wrapper like (leaf emacs ...)

- [ ] everything should be ready now, but before switching, push everything to github, create a new branch, and apply the changes and fix any breakages.

* Preface

What is Emacs? : Emacs is a programming text editor that's absurdly hackable and malleable, to what is seemingly no bounds. It has a rich ecosystem of packages and it has stood the test of time of sticking around for than 50 years since it's creation. However, it's not as popular as other programming text editors, and if I had to guess some reasons why, it would likely be due to its extreme depth and complexity, to the extent to where you'll likely be spending more time tinkering with and working with the editor than to simply edit text. However, from my experience, every amount I've spent working on configuring Emacs was well worth it. Since I now live in and revere in this handcrafted, software Swiss Army knife with hundreds of tools and counting. Including a garden, living room, and a text editor.

Below is my full Emacs configuration, in literate form. I have each code block be automatically exported to files, which are then evaluated by Emacs at startup to create my environment.

As of writing, it's been around 4 years in the making.

* early-init.el

The =early-init.el= file is the first config file to be loaded by Emacs at startup. It's ran before the initial "frame", or desktop window, is shown.
Here we set things such as path variables I'll use throughout the rest of the config, tweaks to the initial frame UI, and etc.

** debugging

#+begin_src emacs-lisp

;; (advice-add 'switch-to-buffer :before (lambda (arg &optional a b) (message "DEBUG: switching to buffer: %s" arg)))
;; (debug-on-entry 'switch-to-buffer)

#+end_src

** variables

Here we set important variables to load during startup, such as disabling the default package manager (to opt in for a different one), set the garbage collection frequency, set compiler settings, and etc.

#+begin_src emacs-lisp :tangle early-init.el :comments link

(setq package-enable-at-startup nil)      ; dont load package.el
(setq gc-cons-threshold (* 50 1000 1000)) ; startup gc
(setq load-prefer-newer t)                ; run .el instead of .elc if newer
(setq native-comp-async-report-warnings-errors nil) ; Silence compiler warnings

#+end_src

** paths

- Here we set variables related to paths.
  - root dir :: the root of the config directory.
  - local dir :: the root of the config directory, as Emacs understands it to be (more on this later).
  - src dir :: the directory that stores most of my config files.
  - submodules dir :: the directory that stores git-cloned repos of packages (for when I don't want to use my package manager).

- Directory tree:
  * root
    * local
      - (temp, state, history, custom-variables, package-manager, etc)
    * src
    * submodules

#+begin_src emacs-lisp :tangle early-init.el :comments link

(defvar my/emacs-root-dir       user-emacs-directory)

(defvar my/emacs-src-dir        (file-name-concat my/emacs-root-dir "src"))
(defvar my/emacs-local-dir      (file-name-concat my/emacs-root-dir "local"))
(defvar my/emacs-submodules-dir (file-name-concat my/emacs-root-dir "submodules"))

;; set local dir to local files
(setq user-emacs-directory      my/emacs-local-dir)

;; set custom-file
(setq custom-file (file-name-concat my/emacs-local-dir "custom-vars.el"))

#+end_src

- On the local dir: Emacs throws temp and state files into the path bound to =user-emacs-directory=, which by default, is set to the root of the config directory. This can get rather messy, so I set the =user-emacs-directory= to a subdirectory "local".

- On the =custom-file= variable: this variable is bound to a path to a file, which contains customizations saved in Emacs' "customize" interface. This file is kept under the local dir.

** tweak UI

Emacs' UI has a lot of bloat by default, so I disable them here.

#+begin_src emacs-lisp :tangle early-init.el :comments link

;; disable tool-bar-setup
(advice-add 'tool-bar-setup :override #'ignore)

;; UI disables
(setq tool-bar-mode nil                 ; disable tool bar
      menu-bar-mode nil                 ; disable menu bar
      scroll-bar-mode nil)              ; disable vertical scroll bar

;; UI tweaks
(setq default-frame-alist
      '((tool-bar-lines . 0)            ; disable tool bar
        (menu-bar-lines . 0)            ; disable menu bar
        (vertical-scroll-bars)          ; disable vertical scroll bar
        (drag-internal-border . t)
        ;; (internal-border-width . 13) ; box border around buffer+modeline (creates gap) (prev: 15)
        (fullscreen . maximized)        ; TODO: ???
        (left-fringe)                   ; set left fringe
        (right-fringe)                  ; set right fringe
        ))

#+end_src

** startup transparency

An Emacs frame can have a transparent background and/or a different color.

#+begin_src emacs-lisp :tangle early-init.el :comments link

;; transparency by default
(unless (assoc 'alpha-background default-frame-alist)
  (add-to-list 'default-frame-alist
               '(alpha-background . 100)))

;; make initial frame invisible (note: requires (make-frame-visible) after theme load)
;; (push '(visibility . nil) initial-frame-alist)

;; use color black for startup frame
;; (add-to-list 'default-frame-alist
;;              '(background-color . "#000000"))

#+end_src

** eln-cache dir

The eln-cache dir is set to the root dir by default, so this is changed to the local dir to reduce clutter.

#+begin_src emacs-lisp :tangle early-init.el :comments link

;; changes the eln-cache dir to be inside a subdir for cleanliness
(when (and (fboundp 'startup-redirect-eln-cache)
           (fboundp 'native-comp-available-p)
           (native-comp-available-p))
  (startup-redirect-eln-cache
   (convert-standard-filename
    (expand-file-name  "var/eln-cache/" my/emacs-local-dir))))

#+end_src

** lsp-booster

The LSP clients =lsp-mode= and =eglot= (?) can be made much more performant by using plists instead of hash tables for deserialization. <TODO: LINK>

This is a necessary step to use =lsp-booster=, which drastically improves the performance of LSP clients. <TODO: LINK>

#+begin_src emacs-lisp :tangle early-init.el :comments link

(setenv "LSP_USE_PLISTS" "true")
(setq lsp-use-plists t)

#+end_src

* init.el

This section encompasses necessities and fundamentals to get Emacs in shape to be tinkered.

** load-path

The =load-path= variable is a list of paths from which "features"/libraries/packages can be loaded from.

Here we add all subdirs of the src dir to the =load-path= recursively, and all subdirs of the submodules dir non-recursively.

#+begin_src emacs-lisp :tangle init.el :comments link

(require 'cl-lib)

(defun add-subdirs-to-load-path (path &optional recursively?)
  "Add PATH and all its subdirs to the `load-path'."
  (when (set 'path (expand-file-name path))
    (add-to-list 'load-path path)
    (if recursively?
        (let ((default-directory path))
          (normal-top-level-add-subdirs-to-load-path))
      (dolist (subdir (directory-files path t directory-files-no-dot-files-regexp t))
        (when (file-directory-p subdir)
          (add-to-list 'load-path subdir))))))

(add-subdirs-to-load-path my/emacs-src-dir t)
(add-subdirs-to-load-path my/emacs-submodules-dir)

#+end_src

** custom-file

The =custom-file= stores the list of customizations made using Emacs' =customize= interface. This file should be loaded after startup to load the saved customizations.

#+begin_src emacs-lisp :tangle init.el :comments link

(defun my/log-customize-set-func (&rest args)
  (message "log: customized: %s" args))
(advice-add 'custom-set-variables :before #'my/log-customize-set-func)
(advice-add 'custom-set-faces     :before #'my/log-customize-set-func)

(add-hook 'elpaca-after-init-hook
          (lambda ()
            (when (file-exists-p custom-file)
              (load custom-file))))

#+end_src

** helper functions

#+begin_src emacs-lisp :tangle init.el :comments link

(defun +load-all (target-dir &optional parent-path)
  "Load all files in TARGET-DIR.
PARENT-PATH defaults to `my/emacs-src-dir'."
  (let* ((dir (file-name-concat (or parent-path my/emacs-src-dir)
                                target-dir))
         (files (directory-files-recursively dir "^[^_].*\\.el$")))
    (dolist (path files)
      (load path))))

(defun +require-all (target-dir &optional parent-path)
  "Load all files in TARGET-DIR.
PARENT-PATH defaults to `my/emacs-src-dir'."
  (let* ((dir (file-name-concat (or parent-path my/emacs-src-dir)
                                target-dir))
         (files (directory-files-recursively dir "^[^_].*\\.el$")))
    (dolist (path files)
      (require (intern
                (file-name-sans-extension
                 (file-name-nondirectory path)))))))

#+end_src

