init.el
;; [[file:Config.org::*load-path][load-path:1]]
(require 'cl-lib)

(defun add-subdirs-to-load-path (path &optional recursively?)
  "Add PATH and all its subdirs to the `load-path'."
  (when (set 'path (expand-file-name path))
    (add-to-list 'load-path path)
    (if recursively?
        (let ((default-directory path))
          (normal-top-level-add-subdirs-to-load-path))
      (dolist (subdir (directory-files path t directory-files-no-dot-files-regexp t))
        (when (file-directory-p subdir)
          (add-to-list 'load-path subdir))))))

(add-subdirs-to-load-path my/emacs-src-dir t)
(add-subdirs-to-load-path my/emacs-submodules-dir)
;; load-path:1 ends here

;; [[file:Config.org::*custom-file][custom-file:1]]
(defun my/log-customize-set-func (&rest args)
  (message "log: customized: %s" args))
(advice-add 'custom-set-variables :before #'my/log-customize-set-func)
(advice-add 'custom-set-faces     :before #'my/log-customize-set-func)

(add-hook 'elpaca-after-init-hook
          (lambda ()
            (when (file-exists-p custom-file)
              (load custom-file))))
;; custom-file:1 ends here

;; [[file:Config.org::*helper functions][helper functions:1]]
(defun +load-all (target-dir &optional parent-path)
  "Load all files in TARGET-DIR.
PARENT-PATH defaults to `my/emacs-src-dir'."
  (let* ((dir (file-name-concat (or parent-path my/emacs-src-dir)
                                target-dir))
         (files (directory-files-recursively dir "^[^_].*\\.el$")))
    (dolist (path files)
      (load path))))

(defun +require-all (target-dir &optional parent-path)
  "Load all files in TARGET-DIR.
PARENT-PATH defaults to `my/emacs-src-dir'."
  (let* ((dir (file-name-concat (or parent-path my/emacs-src-dir)
                                target-dir))
         (files (directory-files-recursively dir "^[^_].*\\.el$")))
    (dolist (path files)
      (require (intern
                (file-name-sans-extension
                 (file-name-nondirectory path)))))))
;; helper functions:1 ends here
