Config.org
** no-littering

#+begin_src emacs-lisp :tangle init.el :comments link

(add-to-list 'load-path (file-name-concat my/emacs-submodules-dir "no-littering"))

;; load
(require 'no-littering)
;; variables
(setq auto-save-default nil)       ; don't autosave all file buffers
(setq backup-by-copying t)         ; safer backups
(setq undo-tree-auto-save-history nil)
;; Dont litter project folders with backup files
(let ((backup-dir (no-littering-expand-var-file-name "backup/")))
  (make-directory backup-dir t)
  (setq backup-directory-alist
        `(("\\`/tmp/" . nil)
          ("\\`/dev/shm/" . nil)
          ("." . ,backup-dir))))
;; Tidy up auto-save files
(let ((auto-save-dir (no-littering-expand-var-file-name "auto-save/")))
  (make-directory auto-save-dir t)
  (setq auto-save-file-name-transforms
        `(("\\`/[^/]*:\\([^/]*/\\)*\\([^/]*\\)\\'"
           ,(concat (file-name-as-directory temporary-file-directory) "\\2") t)
          ("\\`/tmp\\([^/]*/\\)*\\(.*\\)\\'" "\\2")
          ("\\`/dev/shm\\([^/]*/\\)*\\(.*\\)\\'" "\\2")
          ("." ,auto-save-dir t))))

#+end_src

** Elpaca (package manager)

#+begin_src emacs-lisp :tangle init.el :comments link

(defvar elpaca-installer-version 0.10)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil :depth 1 :inherit ignore
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (<= emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                  ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                  ,@(when-let* ((depth (plist-get order :depth)))
                                                      (list (format "--depth=%d" depth) "--no-single-branch"))
                                                  ,(plist-get order :repo) ,repo))))
                  ((zerop (call-process "git" nil buffer t "checkout"
                                        (or (plist-get order :ref) "--"))))
                  (emacs (concat invocation-directory invocation-name))
                  ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                        "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                  ((require 'elpaca))
                  ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))

;; setup use-package
(elpaca elpaca-use-package
        (elpaca-use-package-mode)
        (setq use-package-always-ensure t)
        (setq use-package-always-defer t))

(elpaca leaf
  :wait) ; deferred by default. demand with :leaf-defer nil

(elpaca leaf-keywords
  (leaf-keywords-init)
  (setq leaf-alias-keyword-alist '((:ensure . :elpaca)))
  (setq leaf-system-defaults (append '(:ensure t) leaf-system-defaults))
  :wait)

;; hack: fix org version mismatch
(elpaca org)

#+end_src

** Elpaca tweaks

#+begin_src emacs-lisp :tangle init.el :comments link

;;; Exclude all externally installed packages from elpaca.

(require 'elpaca)
(require 'cl-lib)
(eval-when-compile (require 'subr-x)) ;; is this ok?

(defun my/elpaca-get-external-pkgs ()
  "Based on `package-load-all-descriptors'."
  (let ((pkg-dir-lst nil)
        (res nil))
    (dolist (dir (cons package-user-dir package-directory-list))
      (when (file-directory-p dir)
        (dolist (pkg-dir (directory-files dir t "\\`[^.]"))
          (when (file-directory-p pkg-dir)
            (push pkg-dir pkg-dir-lst)))))
    (dolist (pkg-dir pkg-dir-lst)
      (let ((pkg-file (expand-file-name (package--description-file pkg-dir)
                                        pkg-dir))
            (signed-file (concat pkg-dir ".signed")))
        (when (file-exists-p pkg-file)
          (with-temp-buffer
            (insert-file-contents pkg-file)
            (goto-char (point-min))
            (let ((pkg-text (read (current-buffer))))
              (if (not (eq 'define-package (car-safe pkg-text)))
                  (error "Package %s doesn't have \"define-package\"" pkg-file)
                (let ((name (cadr pkg-text)))
                  (when name
                    (cl-pushnew (intern name) res)))))))))
    res))

(dolist (pkg (my/elpaca-get-external-pkgs))
  (push pkg elpaca-ignored-dependencies))

#+end_src

** post-init

#+begin_src emacs-lisp :tangle init.el :comments link

(add-hook 'emacs-startup-hook
          (lambda ()
            (message "*** Emacs loaded in %s seconds with %d garbage collections."
                     (emacs-init-time "%.2f")
                     gcs-done)))

(add-hook 'elpaca-after-init-hook
          (lambda ()
            (setq gc-cons-threshold (* 10000 10000))))

#+end_src

** required packages

#+begin_src emacs-lisp :tangle init.el :comments link

(use-package general :ensure (:wait t)
  :demand t
  :config
  (general-create-definer +leader-bind
    :prefix "C-c"))

(use-package diminish :ensure (:wait t)
  :demand t)

(use-package which-key :ensure (:wait t)
  :demand t
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3)
  (which-key-mode 1))

(use-package hydra :ensure (:wait t)
  :demand t)

#+end_src

** load main

#+begin_src emacs-lisp :tangle init.el :comments link

(require 'main)

(message "Emacs initialized!")

#+end_src

* --- Main ---

the rest below is main

* Base

** buffer reverting and management

#+begin_src emacs-lisp

;; revert buffer when its file is changed on the filesystem
(leaf autorevert :ensure nil
  :require t
  :diminish autorevert-mode
  :init
  (global-auto-revert-mode 1)
  :setq
  (global-auto-revert-non-file-buffers . t)
  (auto-revert-use-notify . nil)
  (auto-revert-interval . 5))

(+leader-bind
  "k" 'kill-current-buffer
  "b" '(:ignore t :which-key "buffer")
  "bk" 'kill-current-buffer
  "bn" 'next-buffer
  "bp" 'previous-buffer
  "bo" '(my/last-selected-buffer :which-key "last-buffer")
  "bb" 'switch-to-buffer
  "bs" 'save-buffer)

(defalias 'my/last-selected-buffer 'mode-line-other-buffer)

#+end_src

** history and recents

#+begin_src emacs-lisp

;; remember recent files
(leaf recentf :ensure nil
  :hook emacs-startup-hook)

;; go to previous location in file when reopening
(leaf saveplace :ensure nil
  :init
  (save-place-mode 1))

;; persist minibuffer history over restarts
(leaf savehist :ensure nil
  :init
  (savehist-mode 1))

#+end_src

** window management

#+begin_src emacs-lisp

(leaf ace-window
  :setq
  (aw-keys . '(?a ?o ?e ?u ?h ?t ?n ?s))
  (aw-scope . 'frame)
  (aw-background . nil)
  ;; (aw-dispatch-always . t)
  :bind
  ("M-o" . ace-window)
  :init
  (+leader-bind
    "w" '(:ignore t :which-key "window")
    "wd" 'delete-window
    "w+" 'balance-windows
    "wa" 'balance-windows-area
    ;; split window
    "wv" 'split-window-horizontally
    "ws" 'split-window-vertically
    ;; select window directionally
    "wp" '(windmove-up    :which-key "select up")
    "wn" '(windmove-down  :which-key "select down")
    "wf" '(windmove-right :which-key "select right")
    "wb" '(windmove-left  :which-key "select left")
    ;; misc
    "wm" 'switch-to-minibuffer))

;; (leaf eyebrowse
;;   :init
;;   (eyebrowse-mode 1))

;; (leaf bufler
;;   :bind
;;   ("C-x C-b" . bufler-list)
;;   :init
;;   (bufler-workspace-mode 1))

#+end_src

